app/controllers/api/v1/book_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def load_book
    @book = Book.find_by id:params[:id]