app/controllers/api/v1/registrations_controller.rb

  def create
    user = User.new user_params
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token") VALUES (?, ?, ?, ?, ?)