app/controllers/api/v1/reviews_controller.rb

  def create
    @review = Review.new review_params
    @review.user_id = current_user.id
    @review.book_id = params[:book_id]

    if @review.save
---
INSERT INTO "reviews" ("title", "current_rating", "recommend_rating", "average_rating", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if valid_user @review.user
      if @review.update review_params
---
UPDATE "reviews" SET "title" = ?, "current_rating" = ?, "recommend_rating" = ?, "average_rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["title", "updated"], ["current_rating", 10], ["recommend_rating", 10], ["average_rating", 10], ["updated_at", "2020-08-21 16:04:01.492280"], ["id", 1]]

  def destroy
    if valid_user @review.user
      if @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]

  def load_book
    @book = Book.find_by id: params[:book_id]
    unless @book.present?
---
SELECT "books".* FROM "books" WHERE "books"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def load_review
    @review = Review.find_by id: params[:id]
    unless @review.present?
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]