app/controllers/concerns/authenticate.rb

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT ?  [["authentication_token", "4jeQ7oweWE8cqnqc98ULz3BX"], ["LIMIT", 1]]
---
  def current_user
    auth_token = request.headers["AUTHENTICATION-TOKEN"]
    return unless auth_token
    @current_user = User.find_by authentication_token: auth_token